Revit 2027 API
WireType.NeutralRequired Property
 Whether or not the neutral point is required.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool NeutralRequired { get; set; }
Public Property NeutralRequired As Boolean
	Get
	Set
public:
property bool NeutralRequired {
	bool get ();
	void set (bool value);
}
member NeutralRequired : bool with get, set
Property Value
Boolean
See Also
Reference
WireType Class
Autodesk.Revit.DB.Electrical Namespace